create table groomi
(
  onep varchar(50),
  twop varchar(50),
  threep integer
);

insert into groomi
values
("김구름", "김김구름", 23),
("멍구름", "김름", 28),
("멍멍이구름", "기임구름", 33),
("구구름", "구름", 35);

select *
from groomi
where onep like "_구름";

select *
from groomi
where twop like "%구름";

select *
from groomi
where threep like '%3';

/*
출력값
+-----------+--------------+--------+
| onep      | twop         | threep |
+-----------+--------------+--------+
| 김구름    | 김김구름     |     23 |
| 멍구름    | 김름         |     28 |
| 구구름    | 구름         |     35 |
+-----------+--------------+--------+
+-----------------+--------------+--------+
| onep            | twop         | threep |
+-----------------+--------------+--------+
| 김구름          | 김김구름     |     23 |
| 멍멍이구름      | 기임구름     |     33 |
| 구구름          | 구름         |     35 |
+-----------------+--------------+--------+
+-----------------+--------------+--------+
| onep            | twop         | threep |
+-----------------+--------------+--------+
| 김구름          | 김김구름     |     23 |
| 멍멍이구름      | 기임구름     |     33 |
+-----------------+--------------+--------+
*/
